import articleBG from '../../assets/images/architecture/article/bg.webp';
import articleMD from '../../assets/images/architecture/article/md.webp';
import articleXS from '../../assets/images/architecture/article/xs.webp';

export const articleArr = [articleXS.src, articleMD.src, articleBG.src];

export const architectureArticle =
    '<p>Высоко взлетают лишь&nbsp;те, кто растет над собой, а&nbsp;не&nbsp;выше других. И&nbsp;для этих людей у&nbsp;SOUL есть секретный ингредиент: высотные башни для окрыляющего чувства заслуженных перемен.</p> <p>Панорамные окна позволяют раствориться в&nbsp;пейзажах Москвы: в&nbsp;зелени Тимирязевского парка и&nbsp;двориков Аэропорта, в&nbsp;беге летних облаков над шпилем Триумф-Паласа и&nbsp;синем стекле башен Москва-Сити.</p> ';

export const architectureText = [
    {
        text1: 'Аэропорт привык жить малоэтажно: самые высокие здания в&nbsp;исторической части района не&nbsp;превышают девяти этажей. Архитекторы именитого британского бюро SimpsonHaugh с&nbsp;уважением отнеслись к&nbsp;этому контексту. И&nbsp;спроектировали SOUL таким образом, что в&nbsp;общественной части квартала пешеходы видят лишь небо в&nbsp;обрамлении небольших домов, словно переносясь из&nbsp;титанической русской столицы в&nbsp;исторический центр европейского городка.',
        text2: 'Высотные корпуса SOUL выстраиваются в&nbsp;каре, оберегая эту уютную атмосферу и&nbsp;открывая своим жителям поэтичные виды на&nbsp;Тимирязевский парк. От&nbsp;трёхэтажной исторической Изофабрики до&nbsp;высотных башен по&nbsp;периметру: здания SOUL взлетают волной над зелёными просторами старого района. Эту волну так сориентировали по&nbsp;сторонам света, чтобы солнце подольше задерживалось на&nbsp;пьяцце перед Изофабрикой и&nbsp;во&nbsp;дворах, усаженных полевыми травами.',
    },
    {
        text1: 'Внешность среднеэтажных домов в&nbsp;SOUL уникальна. Разнообразие оттенков клинкера, паттернов кладки и&nbsp;декора оконных проемов создает ощущение прогулки по&nbsp;живому, постоянно меняющемуся городу. Колористика фасадов внутренних дворов основана на&nbsp;концепции жеоды*: закрытый от&nbsp;посторонних, каждый двор раскрашен в&nbsp;свой драгоценный цвет.',
        text2: '*Жеода&nbsp;&mdash; замкнутая полость в&nbsp;горной породе, внутри которой находятся кристаллы того или иного минерала. Слово &laquo;жеода&raquo; означает &laquo;шарообразный&raquo; и&nbsp;имеет греческое происхождение. Жеоды с&nbsp;самоцветами&nbsp;&mdash; аметистами, цитринами, агатами и&nbsp;пр.&nbsp;&mdash; являются объектом коллекционирования.',
    },
];
