export const historyText = [
    {
        firstText:
            'Современный район Аэропорт исторически расположен на&nbsp;территории двух сёл: Всехсвятское и&nbsp;Петровское-Зыково. Здесь находился зимний дворец, в&nbsp;котором императорские особы останавливались перед въездом в&nbsp;Москву. Сёла были одним из&nbsp;любимых мест гуляний москвичей.',
        secondText:
            'Благодаря строительству в&nbsp;1776&ndash;1780&nbsp;гг.&nbsp;по&nbsp;приказу Екатерины&nbsp;II Петровского путевого дворца и&nbsp;Петровского регулярного парка эта территория стала местом загородного пребывания аристократии.',
    },
    {
        title: 'Изофабрика Всекохудожника',
        text: 'В&nbsp;1920-е годы в&nbsp;районе Нижней Масловки существовал клуб художников, а&nbsp;вернее своеобразный городок ремёсел. Именитые мастера такие как Кустодиев, Васнецов, а&nbsp;позже и&nbsp;Дейнека, творили здесь сами и&nbsp;обучали основам искусства других.',
    },
];

export const historyCenterText = {
    title: 'Продолжение эстетики района',
    firstText:
        'В&nbsp;архитектуре района доминирует застройка 1950-1960-х годов&nbsp;&mdash; сомасштабные человеку здания с&nbsp;зелёными дворами и&nbsp;тихими улицами, но&nbsp;грандиозным его украшением поистине являются памятники разных архитектурных стилей предшествующих эпох.',
    secondText:
        'SOUL является логичным продолжением энергии, эстетики, смыслов и&nbsp;назначений этого уникального места на&nbsp;карте города.',
};
