export const infrastructureTextBlockData = [
    {
        title: 'Будьте с&nbsp;людьми, чтобы лучше понять себя',
        firstText:
            'SOUL начинается с&nbsp;площади. И&nbsp;это не&nbsp;просто солнечное пространство, открывающее лучший вид на&nbsp;историческое здание Изофабрики. Как в&nbsp;любом старом европейском городе, главная площадь SOUL спроектирована быть центром общественной жизни&nbsp;&mdash; и&nbsp;не&nbsp;только в&nbsp;квартале, но&nbsp;и&nbsp;во&nbsp;всем районе Аэропорт. Здесь апероль спритц на&nbsp;летних террасах делает июль лучшим месяцем года. А&nbsp;спешлти-кофейни программируют рождественское настроение чашкой какао с&nbsp;зефирками.',
        secondText:
            'Здесь назначают свидания у&nbsp;аркады и&nbsp;любуются собственным домом в&nbsp;зеркальной глади пруда. Любуются новогодними фейерверками, пишут цветущие яблони на&nbsp;пленэре и&nbsp;бегают с&nbsp;малышами между струями сухого фонтана. Как&nbsp;бы вы&nbsp;ни&nbsp;захотели провести свободное время, оно начнется на&nbsp;площади&nbsp;&mdash; ведь именно здесь SOUL открывает людям свои объятия.',
    },
    {
        title: 'Забыть о&nbsp;материальном&nbsp;&mdash; это идеально',
        firstText:
            'SOUL ставит идеальное выше материального&nbsp;&mdash; но&nbsp;продолжает идеально заботиться о&nbsp;ваших вещах. Его подземный паркинг рассчитан на&nbsp;555 автомобилей&nbsp;&mdash; включая электрокары, для которых предусмотрены зарядные станции. Ещё 60&nbsp;наземных парковочных мест ждут ваших гостей и&nbsp;посетителей Изофабрики.',
        secondText:
            'Помимо паркинга на&nbsp;подземных этажах разместятся кладовые комнаты для хранения сезонных и&nbsp;крупногабаритных вещей. Въезд в&nbsp;паркинг регулирует система распознавания автомобильных номеров. А&nbsp;видеонаблюдение и&nbsp;система экстренной связи с&nbsp;постами охраны позволят забыть волнения обо всем материальном&nbsp;&mdash; ровно так, как любит SOUL.',
        link: '',
    },
];

export const infrastructureText = [
    {
        title: 'Самое продуктивное, чем можно здесь заняться,&nbsp;&mdash; это отдых',
        firstText:
            'Занятия, которые действительно важны в&nbsp;жизни, требуют неспешного ритма. Как в&nbsp;старой притче про буддиста, который считал суетой даже созерцание, как растут деревья. Таковы и&nbsp;жители SOUL. Они никуда не&nbsp;спешат и&nbsp;уделяют время главному. Подолгу гуляют с&nbsp;детьми, друзьями и&nbsp;собаками. Находят уединение на&nbsp;лесных тропинках в&nbsp;самом сердце города. Сеют в&nbsp;своей душе зерна перемен&nbsp;&mdash; чтобы через годы вырасти над прежним собой.',
    },
    {
        title: 'Оставьте чужие голоса снаружи. Здесь слушают свой внутренний голос',
        firstText:
            'Дизайнеры бюро Kemelin Partners осмыслили лобби как интерьер загородного дома. И&nbsp;эта теплая ламповая атмосфера окутает вас с&nbsp;порога.\n' +
            'Она во&nbsp;всем. В&nbsp;природности материалов: деревянных панелей стен, каменных столешниц, натуральной обивке диванов и&nbsp;кресел. В&nbsp;янтарном свете бра и&nbsp;торшеров над столами. В&nbsp;панорамных окнах во&nbsp;всю 4,5-метровую высоту лобби, за&nbsp;которыми безмолвно падает снег.',
        subtitle: 'Здесь есть всё, чего вы&nbsp;ожидаете от&nbsp;дома, который заботится о&nbsp;близких',
        secondText:
            'Комната для хранения колясок и&nbsp;велосипедов. Кофемашина и&nbsp;полки буккроссинга. Ящик для сбора батареек и&nbsp;душевая для мойки собачьих лап. Постамат и&nbsp;гостевой санузел. Из&nbsp;лобби можно выйти и&nbsp;на&nbsp;улицу, и&nbsp;во&nbsp;внутренний двор. В&nbsp;лифте&nbsp;&mdash; подняться в&nbsp;квартиру и&nbsp;спуститься в&nbsp;подземный паркинг.',
    },
];

export const articleText = {
    title: 'Детские сады',
    firstText:
        'Малышей ждет и&nbsp;ежедневное веселье со&nbsp;сверстниками в&nbsp;детских садах. В&nbsp;SOUL их&nbsp;два: большой на&nbsp;200 мест и&nbsp;малый на&nbsp;100 детей&nbsp;&mdash; в&nbsp;нём кроме передовых педагогических практик и&nbsp;современных пространств появятся безопасные игровая и&nbsp;прогулочная зоны на&nbsp;эксплуатируемой кровле.<br/><br/>\n' +
        '\n' +
        'Детский сад на&nbsp;100 детей расположен в&nbsp;1й&nbsp;очереди строительства. Ввод в&nbsp;эксплуатацию запланирован на&nbsp;3&nbsp;квартал 2025&nbsp;года.<br/><br/>\n' +
        '\n' +
        'Второй детский сад на&nbsp;200 детей находится в&nbsp;4й&nbsp;очереди строительства, его планируется ввести в&nbsp;эксплуатацию в&nbsp;2031&nbsp;году.<br/><br/>\n' +
        '\n' +
        'Также для детей в&nbsp;здании Изофабрики откроется школа искусств.',
    secondText: '',
};
