export const isoFactoryTextBlockData = [
    {
        title: 'Мир меняют&nbsp;те, кто остается собой',
        firstText:
            'В&nbsp;каждом новом жилом комплексе есть инфраструктура, которая облегчает быт. Но&nbsp;только SOUL создает инфраструктуру, облегчающую бытие.\n' +
            'Доживи архитектор Георгий Гольц до&nbsp;наших дней, он&nbsp;был&nbsp;бы счастлив увидеть, что его Изофабрика продолжает служить целям, ради которых проектировалась. Творческому самовыражению. Деятельному самопознанию. Саморазвитию, которому покорны все возрасты.',
        secondText:
            'Изофабрика&nbsp;&mdash; главный пазл в&nbsp;чувственной, аналоговой и&nbsp;ламповой идентичности SOUL. Открывшись после реставрации, она станет лабораторией новых смыслов и&nbsp;впечатлений не&nbsp;только для жителей квартала, но&nbsp;и&nbsp;для всей Москвы.\n' +
            'Игра, непрерывное образование, просвещение и&nbsp;особый вид заботы о&nbsp;человечестве, который сегодня называют &laquo;импактом&raquo;,&nbsp;&mdash; вот четыре столпа, на&nbsp;которых стоит возрожденная Изофабрика.',
    },
    {
        title: 'Образование и&nbsp;игра',
        firstText:
            'На&nbsp;втором этаже Изофабрики предусмотрено пространство для детского клуба раннего развития и&nbsp;лаборатории дополнительного образования STEAM. Этот практико-ориентированный подход к&nbsp;обучению основан на&nbsp;междисциплинарности, межпредметности и&nbsp;решении практических задач. То&nbsp;есть, моделирует для детей огромный и&nbsp;удивительный мир&nbsp;&mdash; во&nbsp;всем его многообразии и&nbsp;сложности взаимосвязей.',
        secondText:
            'Пространство и&nbsp;программа Изофабрики спроектированы так, чтобы вызывать любопытство, удивлять и&nbsp;пробуждать творческий потенциал. Реализовать его можно в&nbsp;изо-мастерских: студии лепки, живописи и&nbsp;графики адресованы и&nbsp;детям, и&nbsp;взрослым. А&nbsp;семейные занятия помогут сблизить первых и&nbsp;вторых.',
    },
];

export const isoFactoryBottomText = {
    title: 'Отдых с&nbsp;пользой для души и&nbsp;тела',
    firstText:
        'Здесь появятся студия осознанности и&nbsp;йоги, комната сенсорного опыта, спешлти-кофейня и&nbsp;топовый ресторан с&nbsp;крытой террасой.',
    secondText:
        'Изофабрика не&nbsp;только генерирует импульсы для развития, но&nbsp;и&nbsp;оставляет пространство для расслабления&nbsp;&mdash; чтобы семена смысла упали на&nbsp;отдохнувшую почву.',
};

export const isoFactoryArticleText =
    'Просветительская программа Изофабрики свёрстана из&nbsp;десятков часов исследовательских прогулок и&nbsp;тематических лекториев, авторских вечеров и&nbsp;мастер-классов. Их&nbsp;тематика предельно широка&nbsp;&mdash; от&nbsp;развития soft skills до&nbsp;проектов в&nbsp;области импакт-экономики. Гольц-холл, выставочное и&nbsp;событийное пространство Изофабрики, станет площадкой для встреч соседских сообществ Сокола и&nbsp;Аэропорта, экомаркетов и&nbsp;дискуссий, способных повлиять на&nbsp;вектор развития обоих районов.';

export const isoFactoryImpactText =
    'SOUL не&nbsp;только влияет на&nbsp;то, как люди чувствуют мир и&nbsp;себя. Но&nbsp;и&nbsp;помогает предпринимателям развивать бизнесы с&nbsp;гуманистическими ценностями. В&nbsp;Изофабрике откроются коворкинг, смарт-офис, библиотека и&nbsp;event-площадка. Современная рабочая инфраструктура поможет резидентам менять правила игры, провоцировать изменения, разрабатывать продукты и&nbsp;услуги, способные изменить мир к&nbsp;лучшему. Дизайн-магазин в&nbsp;концепции Zero waste покажет один из&nbsp;путей, как реализовать эти улучшения на&nbsp;практике.';
