export const landscapingData = [
    {
        title: 'Не&nbsp;всем голосам нужны слова. Слушайте сердце',
        firstText:
            'Проектируя благоустройство квартала, дизайнеры международной компании Gillespies вдохновились духом и&nbsp;историей Изофабрики&nbsp;&mdash; и&nbsp;сформулировали два ключевых принципа, которые прослеживаются в&nbsp;каждом уголке квартала.\n' +
            'Принцип живописности наделяет элементы ландшафта природными, бионическими, текучими формами: в&nbsp;SOUL пейзажи продуманы так, чтобы каждый был достоен кисти живописца.',

        secondText:
            'Принцип скульптурности видоизменяет территорию, как стеки и&nbsp;резцы&nbsp;&mdash; скульптурную глину. Геопластика и&nbsp;разноуровневые площадки, аллеи и&nbsp;сады, игровые зоны и&nbsp;общественные пространства&nbsp;&mdash; в&nbsp;SOUL всё приобретает скульптурную выверенность, объемность и&nbsp;завершенность формы.',
    },
    {
        title: 'Откройте мир заново, взглянув на&nbsp;него глазами ребенка',
        firstText:
            'Эйнштейн говорил, что игра&nbsp;&mdash; это высшая форма исследования. SOUL развил его мысль, сделав исследователями всех детей. \n' +
            'В&nbsp;квартале насчитывается более 20&nbsp;игровых локаций&nbsp;&mdash; \n' +
            'от&nbsp;многофункциональных спортивных площадок для старших \n' +
            'до&nbsp;детских зон во&nbsp;дворах жилых корпусов. Закрытые \n' +
            'для незнакомцев, дворы становятся настоящими экспериментальными лабораториями в&nbsp;эйнштейновско-\n' +
            'игровом смысле слова.',

        secondText:
            'Дизайнеры разработали увлекательные горки супрематической формы, спроектировало дорожки для гонок на&nbsp;самокатах и&nbsp;беговелах, позаботилось о&nbsp;батутах и&nbsp;лазалках \n' +
            'на&nbsp;искусственных холмах. Чтобы каждая минута, проведенная \n' +
            'на&nbsp;улице, приносила детям новые эмоции, навыки и&nbsp;знания.',
    },
];

export const landscapingCardsData = [
    {
        title: '01&nbsp;/ Прямые авеню',
        text:
            'В&nbsp;среднеэтажной части квартала&nbsp;&mdash; с&nbsp;витринами магазинов, уютными кафе \n' +
            'и&nbsp;шеренгами багряных кленов.',
    },
    {
        title: '02&nbsp;/ Извилистые дорожки',
        text: 'Во&nbsp;дворах, среди рукотворных холмов и&nbsp;лугов, отражающих принципы скульптурности и&nbsp;живописности.',
    },
    {
        title: '03&nbsp;/ Лесные тропинки',
        text: 'Для уединенных прогулок среди высоких деревьев, высаженных по&nbsp;периметру квартала.',
    },
    {
        title: '04&nbsp;/ Беговые дорожки',
        text: 'Чтобы устроить полноценную заминку после занятий на&nbsp;воркаут-площадке.',
    },
];
