export const filters = [
    {
        text: 'Все объекты',
        color: 'white',
        group: 'all',
    },
    {
        text: 'Парки и скверы',
        color: 'black',
        group: 'park',
    },
    {
        text: 'Кафе и рестораны',
        color: 'brown',
        group: 'cafe',
    },
    {
        text: 'Образование',
        color: 'blue',
        group: 'school',
    },
    {
        text: 'Детские сады',
        color: 'green',
        group: 'kinder',
    },
    {
        text: 'Торговые центры',
        color: 'orange',
        group: 'shopping',
    },
    {
        text: 'Больницы и поликлиники',
        color: 'purple',
        group: 'hospital',
    },
    {
        text: 'Спорт',
        color: 'yellow',
        group: 'sport',
    },
];

export const locations = [
    {
        category: 'Парки и скверы',
        coords: '55.820210, 37.546458',
        comment: 'Тимирязевский парк',
    },
    {
        category: 'Парки и скверы',
        coords: '55.822114,37.476375',
        comment: 'Парк Покровское-Стрешнево',
    },
    {
        category: 'Парки и скверы',
        coords: '55.806539, 37.527018',
        comment: 'Сквер у&nbsp;Амбулаторного пруда',
    },
    {
        category: 'Парки и скверы',
        coords: '55.799645, 37.512293',
        comment: 'Мемориально-парковый комплекс героев Первой мировой войны',
    },
    {
        category: 'Парки и скверы',
        coords: '55.801148, 37.521673',
        comment: 'Чапаевский парк',
    },
    {
        category: 'Парки и скверы',
        coords: '55.796242, 37.508921',
        comment: 'Старый сиреневый сад Л.&nbsp;А.&nbsp;Колесникова',
    },
    {
        category: 'Парки и скверы',
        coords: '55.795707, 37.516417',
        comment: 'Сквер Дивизии Московского Народного Ополчения',
    },
    {
        category: 'Парки и скверы',
        coords: '55.810936, 37.482340',
        comment: 'Всехсвятская роща',
    },
    {
        category: 'Парки и скверы',
        coords: '55.806337, 37.472722',
        comment: 'Щукинский парк',
    },
    {
        category: 'Парки и скверы',
        coords: '55.819830, 37.501618',
        comment: 'Парк имени Воровского',
    },
    {
        category: 'Парки и скверы',
        coords: '55.815835, 37.502397',
        comment: 'Сквер Космонавта Волкова',
    },
    {
        category: 'Парки и скверы',
        coords: '55.793470, 37.556803',
        comment: 'Петровский парк',
    },
    {
        category: 'Парки и скверы',
        coords: '55.787036, 37.515317',
        comment: 'Парк Березовая Роща',
    },
    {
        category: 'Парки и скверы',
        coords: '55.786741, 37.530308',
        comment: 'Ходынское Поле',
    },

    {
        category: 'Кафе и рестораны',
        coords: '55.810418, 37.518824',
        comment: 'Хуан Хэ',
    },
    {
        category: 'Кафе и рестораны',
        coords: '55.804213, 37.520215',
        comment: 'Eat Market Алкон',
    },
    {
        category: 'Кафе и рестораны',
        coords: '55.806804, 37.517735',
        comment: 'АндерСон',
    },
    {
        category: 'Кафе и рестораны',
        coords: '55.804877, 37.525480',
        comment: 'ГастроПаб ЧилиЧукиня',
    },
    {
        category: 'Кафе и рестораны',
        coords: '55.790899, 37.542776',
        comment: 'Кофемания',
    },
    {
        category: 'Кафе и рестораны',
        coords: '55.788799, 37.539016',
        comment: 'Brasserie Lambic',
    },
    {
        category: 'Кафе и рестораны',
        coords: '55.808539, 37.512517',
        comment: 'Osteria Mario',
    },
    {
        category: 'Кафе и рестораны',
        coords: '55.801960, 37.531062',
        comment: 'Корчма Тарас Бульба',
    },
    {
        category: 'Кафе и рестораны',
        coords: '55.802882, 37.525313',
        comment: 'Черчилль паб',
    },
    {
        category: 'Кафе и рестораны',
        coords: '55.801683, 37.531222',
        comment: 'Джонджоли',
    },

    {
        category: 'Образование',
        coords: '55.807880, 37.515961',
        comment: 'Инженерно-техническая школа дважды Героя Советского Союза П.&nbsp;Р. Поповича',
    },
    {
        category: 'Образование',
        coords: '55.809988, 37.526872',
        comment: 'Российская открытая академия транспорта Рут МИИТ',
    },
    {
        category: 'Образование',
        coords: '55.811628, 37.532888',
        comment: 'Колледж автомобильного транспорта &#8470;&nbsp;9',
    },
    {
        category: 'Образование',
        coords: '55.804837, 37.531778',
        comment: 'Школа &#8470;&nbsp;1575',
    },
    {
        category: 'Образование',
        coords: '55.807245, 37.517611',
        comment: 'Колледж архитектуры и&nbsp;строительства &#8470;&nbsp;7',
    },
    {
        category: 'Образование',
        coords: '55.802453, 37.515629',
        comment: 'Школа &#8470;&nbsp;1384 имени Леманского',
    },
    {
        category: 'Образование',
        coords: '55.799612, 37.508395',
        comment: 'Школа с&nbsp;углубленным изучением французского языка &#8470;&nbsp;1251',
    },
    {
        category: 'Образование',
        coords: '55.801220, 37.518467',
        comment: 'Школа с&nbsp;углубленным изучением немецкого языка &#8470;&nbsp;1249',
    },
    {
        category: 'Образование',
        coords: '55.816796, 37.519912',
        comment: 'Школа &#8470;&nbsp;213',
    },
    {
        category: 'Образование',
        coords: '55.784440, 37.531589',
        comment: 'Школа &#8470;&nbsp;1409',
    },
    {
        category: 'Образование',
        coords: '55.809914, 37.496431',
        comment: 'Школа с&nbsp;углубленным изучением испанского языка имени Сервантеса &#8470;&nbsp;1252',
    },
    {
        category: 'Образование',
        coords: '55.805871, 37.500200',
        comment: 'Школа &#8470;&nbsp;149 имени Героя Советского Союза Ю.&nbsp;Н. Зыкова',
    },
    {
        category: 'Образование',
        coords: '55.802192, 37.529087',
        comment: 'Московский автомобильно-дорожный государственный технический университет',
    },
    {
        category: 'Образование',
        coords: '55.800905, 37.528317',
        comment: 'Финансовый университет при Правительстве&nbsp;РФ',
    },
    {
        category: 'Образование',
        coords: '55.809884, 37.506253',
        comment: 'Московский технологический институт',
    },
    {
        category: 'Образование',
        coords: '55.807408, 37.497853',
        comment: 'Московская художественно-промышленная академия имени С.&nbsp;Г.&nbsp;Строганова',
    },

    {
        category: 'Детские сады',
        coords: '55.808992, 37.541590',
        comment: 'Discovery English Preschool',
    },
    {
        category: 'Детские сады',
        coords: '55.809119, 37.523239',
        comment: 'Детский сад при школе &#8470;&nbsp;152',
    },
    {
        category: 'Детские сады',
        coords: '55.806101, 37.529830',
        comment: 'Slamikids',
    },
    {
        category: 'Детские сады',
        coords: '55.807214, 37.520018',
        comment: 'Детский сад при Инженерно-технической школе',
    },
    {
        category: 'Детские сады',
        coords: '55.803424, 37.515739',
        comment: 'Детский сад при школе &#8470;&nbsp;1384',
    },
    {
        category: 'Детские сады',
        coords: '55.800594, 37.508591',
        comment: 'Детский сад при школе &#8470;&nbsp;1251',
    },

    {
        category: 'Торговые центры',
        coords: '55.805812, 37.515043',
        comment: 'Метромаркет',
    },
    {
        category: 'Торговые центры',
        coords: '55.801765, 37.531894',
        comment: 'Галерея Аэропорт',
    },
    {
        category: 'Торговые центры',
        coords: '55.790491, 37.531373',
        comment: 'Авиапарк',
    },
    {
        category: 'Торговые центры',
        coords: '55.823493, 37.497698',
        comment: 'Метрополис',
    },
    {
        category: 'Больницы и поликлиники',
        coords: '55.801541, 37.535945',
        comment: 'Центральная поликлиника Литфонда',
    },
    {
        category: 'Больницы и поликлиники',
        coords: '55.806971, 37.515678',
        comment: 'Ист Клини',
    },
    {
        category: 'Больницы и поликлиники',
        coords: '55.808513, 37.524660',
        comment: 'Ion Clinic',
    },
    {
        category: 'Больницы и поликлиники',
        coords: '55.811312, 37.529622',
        comment: 'Детская клиника РЖД-Медицина',
    },
    {
        category: 'Больницы и поликлиники',
        coords: '55.797280, 37.540668',
        comment: 'Медси',
    },

    {
        category: 'Спорт',
        coords: '55.798430, 37.520760',
        comment: 'World Class',
    },
    {
        category: 'Спорт',
        coords: '55.810123, 37.506501',
        comment: 'Национальный Хоккейный центр',
    },
    {
        category: 'Спорт',
        coords: '55.807499, 37.511603',
        comment: 'Undefeated Boxing Gym',
    },
    {
        category: 'Спорт',
        coords: '55.792898, 37.520384',
        comment: 'Tennisteam',
    },
    {
        category: 'Спорт',
        coords: '55.792329, 37.522047',
        comment: 'Плавательный бассейн ЦСКА',
    },
    {
        category: 'Спорт',
        coords: '55.785522, 37.541559',
        comment: 'Encore Fitness',
    },
    {
        category: 'Спорт',
        coords: '55.786450, 37.539727',
        comment: 'Дворец спорта &laquo;Мегаспорт&raquo;, спортивные школы',
    },
    {
        category: 'Спорт',
        coords: '55.792155, 37.515917',
        comment: 'Детская футбольная школа',
    },
    {
        category: 'Спорт',
        coords: '55.795193, 37.537724',
        comment: 'Спортивная школа ЦСКА',
    },
    {
        category: 'Спорт',
        coords: '55.791048, 37.560737',
        comment: 'Школа Бокса',
    },
    {
        category: 'Спорт',
        coords: '55.808161, 37.539645',
        comment: 'Crocus Fitness',
    },
];

export const locationText = [
    {
        title: 'Вы&nbsp;не&nbsp;встретите здесь заурядных людей. Они не&nbsp;встретят заурядного человека в&nbsp;вас',
        text: '<p>\n' +
            'Сокол и&nbsp;Аэропорт. Разделенные Ленинградским шоссе, эти районы десятилетиями остаются единомышленниками.\n' +
            'Аэропортовский Городок художников состязается в&nbsp;атмосферности и&nbsp;романтизме с&nbsp;Поселком художников в&nbsp;Соколе.\n' +
            'Всехсвятский студенческий городок передает привет профессорским династиям, живущим по&nbsp;ту&nbsp;сторону Ленинградки.\n' +
            '</p>\n' +
            '<p>\n' +
            'Родители со&nbsp;всей Москвы ищут возможность переехать так, чтобы прикрепиться к&nbsp;одной из&nbsp;знаменитых местных школ...\n' +
            'Здесь исповедуют общие ценности. Интеллигентность. Уважение к&nbsp;культуре и&nbsp;искусству. Стремление быть, а&nbsp;не\n' +
            'казаться. SOUL на&nbsp;Часовой впитывает суть обоих районов&nbsp;&mdash; и&nbsp;наполняет их&nbsp;смыслами современные жилые дома и\n' +
            'историческое здание Изофабрики.\n' +
            '</p>'
    },
    {
        title: 'Обретите свободу в&nbsp;самодостаточности',
        text: 'Аэропорт и&nbsp;Сокол. В&nbsp;Советском Союзе их&nbsp;проектировали быть интеллектуальным и&nbsp;творческим центром столицы.\n' +
            'Современность добавила к&nbsp;этому портрету свежие штрихи: штаб-квартиры IT-компаний, крупные офисные центры,\n' +
            'обновленные парки и&nbsp;спортивные комплексы.'
    }
]
