export const whiteBoxText = [
    {
        title: 'Станьте тем, кем вас никто не&nbsp;ожидал увидеть',
        firstText:
            'Квартиры в&nbsp;SOUL сдаются в&nbsp;отделке white box: в&nbsp;них уже выполнены черновые работы, но&nbsp;ещё нет вашей индивидуальности. Это чистый холст&nbsp;&mdash; и&nbsp;вы&nbsp;решаете, какие краски взять и&nbsp;какими сюжетами наполнить жизнь, чтобы она стала ближе к&nbsp;совершенству.',
    },
    {
        title: 'Быть не&nbsp;занятым&nbsp;&mdash; это нормально',
        firstText:
            'Город демонстрирует, как индустриальный и&nbsp;цифровой прогресс ускоряет жизнь. Но&nbsp;в&nbsp;SOUL технологии существуют с&nbsp;противоположной целью: замедлять жизнь до&nbsp;той скорости, которая комфортна лично вам.',
    },
];

export const whiteBoxSlider = [
    {
        svgId: 'GSM',
        text: 'Устойчивая GSM-связь в&nbsp;лифте, внутреннем дворе и&nbsp;подземной автостоянке',
    },
    {
        svgId: 'camera',
        text: 'Системы видеонаблюдения',
    },
    {
        svgId: 'charger',
        text: 'Зарядка для электромобилей в&nbsp;паркинге',
    },
    {
        svgId: 'counter',
        text: 'Индивидуальные счётчики для всех потребляемых энергоресурсов',
    },
    {
        svgId: 'AC',
        text: 'Центральная система кондиционирования',
    },
    {
        svgId: 'glass',
        text: 'Фильтрация и&nbsp;водоподготовка для улучшения качества воды',
    },
    {
        svgId: 'bin',
        text: 'Система сортировки мусора на&nbsp;каждом этаже',
    },
    {
        svgId: 'water',
        text: 'Датчики защиты от&nbsp;протечек',
    },
];

export const points = [
    { number: 1, top: 38.33, left: 27.35, text: 'Внутренние перегородки' },
    { number: 2, top: 59.23, left: 21.44, text: 'Электрический вывод под кухонную технику' },
    { number: 3, top: 18.9, left: 57.62, text: 'Электрические выводы под освещение' },
    { number: 4, top: 31.5, left: 42.8, text: 'Вывод под электропривод для штор' },
    { number: 5, top: 55.91, left: 31.81, text: 'Мастер&#8209;свет' },
    { number: 6, top: 46.68, left: 69.94, text: 'Выравнивание стен' },
    { number: 7, top: 57, left: 4.2, text: 'Измельчитель пищевых отходов' },
    { number: 8, top: 88.33, left: 57.21, text: 'Стяжка пола с&nbsp;шумоизоляцией' },
    { number: 9, top: 44.31, left: 49.6, text: 'Двухкамерные стеклопакеты с&nbsp;алюминиевым профилем' },
    {
        number: 10,
        top: 52.73,
        left: 58.42,
        text: 'Безопасные стеклянные ограждения из&nbsp;триплекса на&nbsp;французских балконах',
    },
    { number: 4, top: 26, left: 83.7, text: 'Вывод под электропривод для штор' },
];
